/************************************************************************/
/*   模块称：按键模块
*   最后修改时间：2018-11-13
*   作者：覃家旺  
*   描述:按键控制                                                        
************************************************************************/
#ifndef __KEY_H
#define __KEY_H

#define KEY1 1
#define KEY2 2
#define KEY3 3
#define KEY_ERROR -1

/**
*	函数名称:KeyInit
*   函数功能:按键初始化
*	输入参数:无
*	返回值:无
**/
void KeyInit();

/**
*	函数名称:key_scan
*   函数功能:按键扫描
*	输入参数:无
*	返回值:
*		有效返回值:KEY1,KEY2,KEY3
*		无效返回值:KEY_ERROR
**/
int key_scan();
#endif

